---
kind: method
id: M:Autodesk.Revit.DB.Instance.GetTransform
source: html/50aa275d-031e-ce19-9cfd-18a7a341ed19.htm
---
# Autodesk.Revit.DB.Instance.GetTransform Method

Gets the transform of the instance.

## Syntax (C#)
```csharp
public Transform GetTransform()
```

## Returns
The inherent transform.